{
  "_class_name": "HunyuanDiT2DModel",
  "_diffusers_version": "0.30.0",
  "attention_head_dim": 88,
  "cross_attention_dim": 1024,
  "cross_attention_dim_t5": 2048,
  "hidden_size": 1408,
  "num_attention_heads": 16,
  "num_layers": 40,
  "patch_size": 2,
  "pooled_projection_dim": 1024,
  "sample_size": 128
}
