{
  "_class_name": "HunyuanDiTPipeline",
  "_diffusers_version": "0.30.0",
  "scheduler": [
    "diffusers",
    "DDPMScheduler"
  ],
  "text_encoder": [
    "transformers",
    "BertModel"
  ],
  "text_encoder_2": [
    "transformers",
    "T5EncoderModel"
  ],
  "transformer": [
    "diffusers",
    "HunyuanDiT2DModel"
  ],
  "vae": [
    "diffusers",
    "AutoencoderKL"
  ]
}
